# AnalysisDisplayMarkersAndTextSettings Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AnalysisDisplayMarkersAndTextSettings Properties
AnalysisDisplayMarkersAndTextSettings Class See Also
---
The AnalysisDisplayMarkersAndTextSettings type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| MarkerSize | Size of marker. |
| MarkerType | Type of marker. |
| Rounding | Increment to which numeric values of analysis results are rounded in markers. |
| TextLabelType | Type of diagram text label visualization. |
| TextTypeId | Element id of text associated with the settings. |

# See Also
AnalysisDisplayMarkersAndTextSettings Class
Autodesk.Revit.DB.Analysis Namespace